* Emacs Play ELisp Notebook

** ob-prolog

#+begin_src elisp
  (require 'ob-prolog)
#+end_src

#+RESULTS:
: ob-prolog

#+begin_src prolog
  ?- print("Hello world!").
#+end_src

#+RESULTS:
: Hello world!

** ob-racket

#+begin_src racket
  #lang racket
  (printf "Hello ~a\n" 'Greg)
#+end_src

#+RESULTS:
: Hello Greg

** Show load-path

#+begin_src elisp :results value list
  load-path
#+end_src

#+RESULTS:
- /home/greg/.emacs.d/private/JGD
- /home/greg/.emacs.d/elpa/29.1/develop/dap-mode-20240113.926
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-docker-20231121.1644
- /home/greg/.emacs.d/elpa/29.1/develop/bui-20210108.1141
- /home/greg/.emacs.d/layers/+spacemacs/spacemacs-visual/local/zoom-frm/
- /home/greg/.emacs.d/elpa/29.1/develop/yasnippet-snippets-20230815.820
- /home/greg/.emacs.d/elpa/29.1/develop/yapfify-20210914.634
- /home/greg/.emacs.d/elpa/29.1/develop/ws-butler-20201117.1528
- /home/greg/.emacs.d/elpa/29.1/develop/writeroom-mode-20220426.2046
- /home/greg/.emacs.d/elpa/29.1/develop/visual-fill-column-20230102.1830
- /home/greg/.emacs.d/elpa/29.1/develop/winum-20190911.1607
- /home/greg/.emacs.d/elpa/29.1/develop/web-mode-20230911.1817
- /home/greg/.emacs.d/elpa/29.1/develop/web-beautify-20161115.2247
- /home/greg/.emacs.d/elpa/29.1/develop/volatile-highlights-20230301.1402
- /home/greg/.emacs.d/elpa/29.1/develop/vim-powerline-20231001.191952
- /home/greg/.emacs.d/elpa/29.1/develop/vi-tilde-fringe-20141028.242
- /home/greg/.emacs.d/elpa/29.1/develop/uuidgen-20220405.1345
- /home/greg/.emacs.d/elpa/29.1/develop/unfill-20230227.1349
- /home/greg/.emacs.d/elpa/29.1/develop/undo-tree-0.8.2
- /home/greg/.emacs.d/elpa/29.1/develop/queue-0.2
- /home/greg/.emacs.d/elpa/29.1/develop/treemacs-projectile-20230703.1929
- /home/greg/.emacs.d/elpa/29.1/develop/treemacs-persp-20230703.1929
- /home/greg/.emacs.d/elpa/29.1/develop/treemacs-magit-20230830.1936
- /home/greg/.emacs.d/elpa/29.1/develop/treemacs-icons-dired-20230930.1141
- /home/greg/.emacs.d/elpa/29.1/develop/treemacs-evil-20230822.2039
- /home/greg/.emacs.d/elpa/29.1/develop/toml-mode-20161107.1800
- /home/greg/.emacs.d/elpa/29.1/develop/toc-org-20220110.1452
- /home/greg/.emacs.d/elpa/29.1/develop/terminal-here-20220827.819
- /home/greg/.emacs.d/elpa/29.1/develop/term-cursor-20190514.154113
- /home/greg/.emacs.d/elpa/29.1/develop/tagedit-20161121.855
- /home/greg/.emacs.d/elpa/29.1/develop/symon-20170224.833
- /home/greg/.emacs.d/elpa/29.1/develop/symbol-overlay-20230729.807
- /home/greg/.emacs.d/elpa/29.1/develop/string-inflection-20220910.1306
- /home/greg/.emacs.d/elpa/29.1/develop/string-edit-at-point-20230118.1933
- /home/greg/.emacs.d/layers/+lang/sql/local/sqlfmt/
- /home/greg/.emacs.d/elpa/29.1/develop/sql-indent-20230922.154618
- /home/greg/.emacs.d/elpa/29.1/develop/sphinx-doc-20210213.1250
- /home/greg/.emacs.d/elpa/29.1/develop/spacemacs-whitespace-cleanup-20220917.95044
- /home/greg/.emacs.d/elpa/29.1/develop/spacemacs-purpose-popwin-20231001.192059
- /home/greg/.emacs.d/elpa/29.1/develop/spaceline-20230922.1127
- /home/greg/.emacs.d/elpa/29.1/develop/powerline-20221110.1956
- /home/greg/.emacs.d/elpa/29.1/develop/space-doc-20231001.192103
- /home/greg/.emacs.d/elpa/29.1/develop/smeargle-20200323.533
- /home/greg/.emacs.d/elpa/29.1/develop/slim-mode-20170728.1348
- /home/greg/.emacs.d/elpa/29.1/develop/shell-pop-20200315.1139
- /home/greg/.emacs.d/elpa/29.1/develop/scss-mode-20180123.1708
- /home/greg/.emacs.d/elpa/29.1/develop/sass-mode-20190502.53
- /home/greg/.emacs.d/elpa/29.1/develop/rustic-20230130.912
- /home/greg/.emacs.d/elpa/29.1/develop/xterm-color-20230321.3
- /home/greg/.emacs.d/elpa/29.1/develop/rust-mode-20230805.1558
- /home/greg/.emacs.d/elpa/29.1/develop/ron-mode-20200830.1554
- /home/greg/.emacs.d/elpa/29.1/develop/restart-emacs-20201127.1425
- /home/greg/.emacs.d/elpa/29.1/develop/request-20230127.417
- /home/greg/.emacs.d/elpa/29.1/develop/rainbow-delimiters-20210515.1254
- /home/greg/.emacs.d/elpa/29.1/develop/racket-mode-20230919.1539
- /home/greg/.emacs.d/elpa/29.1/develop/quickrun-20221215.828
- /home/greg/.emacs.d/elpa/29.1/develop/pytest-20230810.1218
- /home/greg/.emacs.d/elpa/29.1/develop/pylookup-20230710.193825
- /home/greg/.emacs.d/elpa/29.1/develop/pyenv-mode-20230821.1645
- /home/greg/.emacs.d/elpa/29.1/develop/pydoc-20221222.1426
- /home/greg/.emacs.d/elpa/29.1/develop/py-isort-20160925.1018
- /home/greg/.emacs.d/elpa/29.1/develop/pug-mode-20211114.1645
- /home/greg/.emacs.d/elpa/29.1/develop/prettier-js-20180109.726
- /home/greg/.emacs.d/elpa/29.1/develop/popwin-20210215.1849
- /home/greg/.emacs.d/elpa/29.1/develop/poetry-20230304.1540
- /home/greg/.emacs.d/elpa/29.1/develop/plantuml-mode-20191102.2056
- /home/greg/.emacs.d/elpa/29.1/develop/pippel-20220416.1743
- /home/greg/.emacs.d/elpa/29.1/develop/pipenv-20220514.123
- /home/greg/.emacs.d/elpa/29.1/develop/load-env-vars-20180511.2210
- /home/greg/.emacs.d/elpa/29.1/develop/pyvenv-20211014.707
- /home/greg/.emacs.d/elpa/29.1/develop/pip-requirements-20181027.1629
- /home/greg/.emacs.d/elpa/29.1/develop/persp-mode-20230110.1045
- /home/greg/.emacs.d/elpa/29.1/develop/password-generator-20210425.2227
- /home/greg/.emacs.d/elpa/29.1/develop/paradox-20191011.1119
- /home/greg/.emacs.d/elpa/29.1/develop/overseer-20180226.619
- /home/greg/.emacs.d/elpa/29.1/develop/outshine-20220326.540
- /home/greg/.emacs.d/elpa/29.1/develop/outorg-20190720.2002
- /home/greg/.emacs.d/elpa/29.1/develop/orgit-forge-20230603.1232
- /home/greg/.emacs.d/elpa/29.1/develop/orgit-20230917.1001
- /home/greg/.emacs.d/elpa/29.1/develop/org-superstar-20230116.1358
- /home/greg/.emacs.d/elpa/29.1/develop/org-rich-yank-20230605.824
- /home/greg/.emacs.d/elpa/29.1/develop/org-projectile-20230817.851
- /home/greg/.emacs.d/elpa/29.1/develop/org-project-capture-20230830.1733
- /home/greg/.emacs.d/elpa/29.1/develop/org-category-capture-20230830.1733
- /home/greg/.emacs.d/elpa/29.1/develop/org-present-20220806.1847
- /home/greg/.emacs.d/elpa/29.1/develop/org-pomodoro-20220318.1618
- /home/greg/.emacs.d/elpa/29.1/develop/alert-20221213.1619
- /home/greg/.emacs.d/elpa/29.1/develop/log4e-20211019.948
- /home/greg/.emacs.d/elpa/29.1/develop/gntp-20141025.250
- /home/greg/.emacs.d/elpa/29.1/develop/org-mime-20230321.2341
- /home/greg/.emacs.d/elpa/29.1/develop/org-download-20220906.1929
- /home/greg/.emacs.d/elpa/29.1/develop/org-contrib-0.4.2
- /home/greg/.emacs.d/elpa/29.1/develop/org-cliplink-20201126.1020
- /home/greg/.emacs.d/elpa/29.1/develop/open-junk-file-20161210.1114
- /home/greg/.emacs.d/elpa/29.1/develop/ob-racket-20180817.4538
- /home/greg/.emacs.d/elpa/29.1/develop/npm-mode-20190616.2025
- /home/greg/.emacs.d/elpa/29.1/develop/nose-20150422.184839
- /home/greg/.emacs.d/elpa/29.1/develop/nodejs-repl-20200802.1310
- /home/greg/.emacs.d/elpa/29.1/develop/nameless-20230112.1259
- /home/greg/.emacs.d/elpa/29.1/develop/mwim-20181110.1900
- /home/greg/.emacs.d/elpa/29.1/develop/multi-vterm-20221031.610
- /home/greg/.emacs.d/elpa/29.1/develop/vterm-20230417.424
- /home/greg/.emacs.d/elpa/29.1/develop/multi-term-20200514.428
- /home/greg/.emacs.d/elpa/29.1/develop/multi-line-20230721.1814
- /home/greg/.emacs.d/elpa/29.1/develop/shut-up-20210403.1249
- /home/greg/.emacs.d/elpa/29.1/develop/markdown-toc-20210905.738
- /home/greg/.emacs.d/elpa/29.1/develop/macrostep-20230813.2123
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-ui-20230811.552
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-treemacs-20230811.611
- /home/greg/.emacs.d/elpa/29.1/develop/treemacs-20230930.1221
- /home/greg/.emacs.d/elpa/29.1/develop/cfrs-20220129.1149
- /home/greg/.emacs.d/elpa/29.1/develop/posframe-20230714.227
- /home/greg/.emacs.d/elpa/29.1/develop/pfuture-20220913.1401
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-python-ms-20230731.1458
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-pyright-20230225.1118
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-origami-20230815.704
- /home/greg/.emacs.d/elpa/29.1/develop/origami-20200331.1019
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-latex-20230717.1707
- /home/greg/.emacs.d/elpa/29.1/develop/consult-20231001.938
- /home/greg/.emacs.d/elpa/29.1/develop/lorem-ipsum-20221214.1857
- /home/greg/.emacs.d/elpa/29.1/develop/livid-mode-20131116.1344
- /home/greg/.emacs.d/elpa/29.1/develop/skewer-mode-20200304.1142
- /home/greg/.emacs.d/elpa/29.1/develop/live-py-mode-20231001.459
- /home/greg/.emacs.d/elpa/29.1/develop/link-hint-20230405.1801
- /home/greg/.emacs.d/elpa/29.1/develop/json-reformat-20220905.2342
- /home/greg/.emacs.d/elpa/29.1/develop/json-navigator-20230904.1757
- /home/greg/.emacs.d/elpa/29.1/develop/hierarchy-20190425.842
- /home/greg/.emacs.d/elpa/29.1/develop/json-mode-20230805.507
- /home/greg/.emacs.d/elpa/29.1/develop/json-snatcher-20200916.1717
- /home/greg/.emacs.d/elpa/29.1/develop/js2-refactor-20210306.2003
- /home/greg/.emacs.d/elpa/29.1/develop/multiple-cursors-20230728.518
- /home/greg/.emacs.d/elpa/29.1/develop/js2-mode-20230628.238
- /home/greg/.emacs.d/elpa/29.1/develop/js-doc-20160715.434
- /home/greg/.emacs.d/elpa/29.1/develop/inspector-20230925.154622
- /home/greg/.emacs.d/elpa/29.1/develop/info+-20230528.194126
- /home/greg/.emacs.d/elpa/29.1/develop/indent-guide-20210115.400
- /home/greg/.emacs.d/elpa/29.1/develop/importmagic-20180520.303
- /home/greg/.emacs.d/elpa/29.1/develop/epc-20140610.534
- /home/greg/.emacs.d/elpa/29.1/develop/ctable-20210128.629
- /home/greg/.emacs.d/elpa/29.1/develop/concurrent-20170601.435
- /home/greg/.emacs.d/elpa/29.1/develop/deferred-20170901.1330
- /home/greg/.emacs.d/elpa/29.1/develop/impatient-mode-20230511.1746
- /home/greg/.emacs.d/elpa/29.1/develop/simple-httpd-20230821.1458
- /home/greg/.emacs.d/elpa/29.1/develop/hungry-delete-20210409.1643
- /home/greg/.emacs.d/elpa/29.1/develop/htmlize-20210825.2150
- /home/greg/.emacs.d/elpa/29.1/develop/hl-todo-20230829.1854
- /home/greg/.emacs.d/elpa/29.1/develop/highlight-parentheses-20220408.845
- /home/greg/.emacs.d/elpa/29.1/develop/highlight-numbers-20181013.1744
- /home/greg/.emacs.d/elpa/29.1/develop/parent-mode-20150824.2300
- /home/greg/.emacs.d/elpa/29.1/develop/highlight-indentation-20210221.1418
- /home/greg/.emacs.d/elpa/29.1/develop/hide-comnt-20191121.82035
- /home/greg/.emacs.d/elpa/29.1/develop/helm-xref-20211017.1334
- /home/greg/.emacs.d/elpa/29.1/develop/helm-themes-20220721.330
- /home/greg/.emacs.d/elpa/29.1/develop/helm-swoop-20210426.547
- /home/greg/.emacs.d/layers/+completion/helm/local/helm-spacemacs-help/
- /home/greg/.emacs.d/layers/+completion/helm/local/helm-spacemacs-faq/
- /home/greg/.emacs.d/elpa/29.1/develop/helm-pydoc-20220721.433
- /home/greg/.emacs.d/elpa/29.1/develop/helm-purpose-20170114.1636
- /home/greg/.emacs.d/elpa/29.1/develop/window-purpose-20210628.715
- /home/greg/.emacs.d/elpa/29.1/develop/imenu-list-20210420.1200
- /home/greg/.emacs.d/elpa/29.1/develop/helm-projectile-20221215.613
- /home/greg/.emacs.d/elpa/29.1/develop/helm-org-rifle-20230821.1927
- /home/greg/.emacs.d/elpa/29.1/develop/helm-org-20210324.1927
- /home/greg/.emacs.d/elpa/29.1/develop/helm-mode-manager-20210108.2330
- /home/greg/.emacs.d/elpa/29.1/develop/helm-make-20200620.27
- /home/greg/.emacs.d/elpa/29.1/develop/helm-lsp-20210419.2014
- /home/greg/.emacs.d/elpa/29.1/develop/lsp-mode-20230928.1235
- /home/greg/.emacs.d/elpa/29.1/develop/spinner-1.7.4
- /home/greg/.emacs.d/elpa/29.1/develop/helm-ls-git-20230924.1610
- /home/greg/.emacs.d/elpa/29.1/develop/helm-git-grep-20170614.1411
- /home/greg/.emacs.d/elpa/29.1/develop/helm-descbinds-20190501.935
- /home/greg/.emacs.d/elpa/29.1/develop/helm-css-scss-20230522.1113
- /home/greg/.emacs.d/elpa/29.1/develop/helm-company-20190812.1429
- /home/greg/.emacs.d/elpa/29.1/develop/helm-comint-20231102.2029
- /home/greg/.emacs.d/elpa/29.1/develop/helm-c-yasnippet-20230911.444
- /home/greg/.emacs.d/elpa/29.1/develop/helm-ag-20221017.1528
- /home/greg/.emacs.d/elpa/29.1/develop/haml-mode-20230608.1833
- /home/greg/.emacs.d/elpa/29.1/develop/graphviz-dot-mode-20230325.1050
- /home/greg/.emacs.d/elpa/29.1/develop/google-translate-20220921.245
- /home/greg/.emacs.d/elpa/29.1/develop/golden-ratio-20230912.1825
- /home/greg/.emacs.d/elpa/29.1/develop/gnuplot-20230323.1400
- /home/greg/.emacs.d/elpa/29.1/develop/gitignore-templates-20210814.144
- /home/greg/.emacs.d/elpa/29.1/develop/git-timemachine-20230630.1214
- /home/greg/.emacs.d/elpa/29.1/develop/git-modes-20230920.1224
- /home/greg/.emacs.d/elpa/29.1/develop/git-messenger-20201202.1637
- /home/greg/.emacs.d/elpa/29.1/develop/git-link-20230518.204
- /home/greg/.emacs.d/elpa/29.1/develop/gh-md-20220316.1432
- /home/greg/.emacs.d/elpa/29.1/develop/forge-20230928.1210
- /home/greg/.emacs.d/elpa/29.1/develop/yaml-20230928.103
- /home/greg/.emacs.d/elpa/29.1/develop/markdown-mode-20230830.1338
- /home/greg/.emacs.d/elpa/29.1/develop/magit-20230924.1834
- /home/greg/.emacs.d/elpa/29.1/develop/magit-section-20230924.1834
- /home/greg/.emacs.d/elpa/29.1/develop/git-commit-20230924.1834
- /home/greg/.emacs.d/elpa/29.1/develop/with-editor-20230917.958
- /home/greg/.emacs.d/elpa/29.1/develop/transient-20230919.2146
- /home/greg/.emacs.d/elpa/29.1/develop/ghub-20230901.1234
- /home/greg/.emacs.d/elpa/29.1/develop/treepy-20230715.2154
- /home/greg/.emacs.d/elpa/29.1/develop/closql-20230914.1250
- /home/greg/.emacs.d/elpa/29.1/develop/emacsql-20230417.1448
- /home/greg/.emacs.d/elpa/29.1/develop/compat-29.1.4.2
- /home/greg/.emacs.d/elpa/29.1/develop/flyspell-correct-helm-20220520.630
- /home/greg/.emacs.d/elpa/29.1/develop/flyspell-correct-20220520.630
- /home/greg/.emacs.d/elpa/29.1/develop/flycheck-pos-tip-20200516.1600
- /home/greg/.emacs.d/elpa/29.1/develop/pos-tip-20230721.834
- /home/greg/.emacs.d/elpa/29.1/develop/flycheck-package-20210509.2325
- /home/greg/.emacs.d/elpa/29.1/develop/package-lint-20230905.629
- /home/greg/.emacs.d/elpa/29.1/develop/flycheck-elsa-20230217.1640
- /home/greg/.emacs.d/elpa/29.1/develop/flycheck-20230813.620
- /home/greg/.emacs.d/elpa/29.1/develop/seq-2.24
- /home/greg/.emacs.d/elpa/29.1/develop/pkg-info-20150517.1143
- /home/greg/.emacs.d/elpa/29.1/develop/epl-20180205.2049
- /home/greg/.emacs.d/elpa/29.1/develop/flx-ido-20221213.542
- /home/greg/.emacs.d/elpa/29.1/develop/flx-20221213.542
- /home/greg/.emacs.d/elpa/29.1/develop/fancy-battery-20150101.1204
- /home/greg/.emacs.d/elpa/29.1/develop/eyebrowse-20201107.955
- /home/greg/.emacs.d/elpa/29.1/develop/expand-region-20221030.957
- /home/greg/.emacs.d/elpa/29.1/develop/evil-visualstar-20160223.48
- /home/greg/.emacs.d/elpa/29.1/develop/evil-visual-mark-mode-20230202.318
- /home/greg/.emacs.d/elpa/29.1/develop/evil-unimpaired-20211227.204012
- /home/greg/.emacs.d/elpa/29.1/develop/evil-tutor-20150103.653
- /home/greg/.emacs.d/elpa/29.1/develop/evil-textobj-line-20211101.1429
- /home/greg/.emacs.d/elpa/29.1/develop/evil-tex-20230715.1752
- /home/greg/.emacs.d/elpa/29.1/develop/evil-surround-20230917.1541
- /home/greg/.emacs.d/elpa/29.1/develop/evil-org-20221001.2335
- /home/greg/.emacs.d/elpa/29.1/develop/evil-numbers-20230117.53
- /home/greg/.emacs.d/elpa/29.1/develop/evil-nerd-commenter-20230625.254
- /home/greg/.emacs.d/elpa/29.1/develop/evil-mc-20230529.210
- /home/greg/.emacs.d/elpa/29.1/develop/evil-matchit-20230625.302
- /home/greg/.emacs.d/elpa/29.1/develop/evil-lisp-state-20160404.248
- /home/greg/.emacs.d/elpa/29.1/develop/evil-lion-20220317.1030
- /home/greg/.emacs.d/elpa/29.1/develop/evil-indent-plus-20230927.1513
- /home/greg/.emacs.d/elpa/29.1/develop/evil-iedit-state-20220219.1432
- /home/greg/.emacs.d/elpa/29.1/develop/evil-goggles-20230630.754
- /home/greg/.emacs.d/elpa/29.1/develop/evil-exchange-20200118.252
- /home/greg/.emacs.d/elpa/29.1/develop/evil-escape-20221103.140825
- /home/greg/.emacs.d/elpa/29.1/develop/evil-easymotion-20200424.135
- /home/greg/.emacs.d/elpa/29.1/develop/evil-collection-20230922.1411
- /home/greg/.emacs.d/elpa/29.1/develop/annalist-20190929.207
- /home/greg/.emacs.d/elpa/29.1/develop/evil-cleverparens-20231001.1423
- /home/greg/.emacs.d/elpa/29.1/develop/smartparens-20230529.1017
- /home/greg/.emacs.d/elpa/29.1/develop/evil-args-20220125.1626
- /home/greg/.emacs.d/elpa/29.1/develop/evil-anzu-20220911.1939
- /home/greg/.emacs.d/elpa/29.1/develop/anzu-20211002.2255
- /home/greg/.emacs.d/elpa/29.1/develop/eval-sexp-fu-20191128.825
- /home/greg/.emacs.d/elpa/29.1/develop/eshell-z-20191116.333
- /home/greg/.emacs.d/elpa/29.1/develop/eshell-prompt-extras-20230924.139
- /home/greg/.emacs.d/elpa/29.1/develop/esh-help-20190905.22
- /home/greg/.emacs.d/elpa/29.1/develop/emr-20220108.548
- /home/greg/.emacs.d/elpa/29.1/develop/iedit-20220216.717
- /home/greg/.emacs.d/elpa/29.1/develop/clang-format-20230809.2200
- /home/greg/.emacs.d/elpa/29.1/develop/projectile-20230919.646
- /home/greg/.emacs.d/elpa/29.1/develop/paredit-20221127.1452
- /home/greg/.emacs.d/elpa/29.1/develop/list-utils-20230422.1740
- /home/greg/.emacs.d/elpa/29.1/develop/emmet-mode-20221111.329
- /home/greg/.emacs.d/elpa/29.1/develop/elisp-slime-nav-20210510.528
- /home/greg/.emacs.d/elpa/29.1/develop/elisp-def-20230901.2308
- /home/greg/.emacs.d/elpa/29.1/develop/editorconfig-20230919.2101
- /home/greg/.emacs.d/elpa/29.1/develop/ediprolog-2.2
- /home/greg/.emacs.d/elpa/29.1/develop/dumb-jump-20230716.1717
- /home/greg/.emacs.d/elpa/29.1/develop/drag-stuff-20161108.749
- /home/greg/.emacs.d/elpa/29.1/develop/dired-quick-sort-20201221.403
- /home/greg/.emacs.d/elpa/29.1/develop/diff-hl-20231207.32
- /home/greg/.emacs.d/elpa/29.1/develop/devdocs-20230220.2042
- /home/greg/.emacs.d/elpa/29.1/develop/define-word-20220104.1848
- /home/greg/.emacs.d/elpa/29.1/develop/cython-mode-20221130.1257
- /home/greg/.emacs.d/elpa/29.1/develop/csv-mode-1.22
- /home/greg/.emacs.d/elpa/29.1/develop/company-web-20220115.2146
- /home/greg/.emacs.d/elpa/29.1/develop/web-completion-data-20160318.848
- /home/greg/.emacs.d/elpa/29.1/develop/company-reftex-20210418.1316
- /home/greg/.emacs.d/elpa/29.1/develop/company-math-20221227.1329
- /home/greg/.emacs.d/elpa/29.1/develop/math-symbol-lists-20220828.2047
- /home/greg/.emacs.d/elpa/29.1/develop/company-auctex-20200529.1835
- /home/greg/.emacs.d/elpa/29.1/develop/yasnippet-20200604.246
- /home/greg/.emacs.d/elpa/29.1/develop/company-anaconda-20230821.2126
- /home/greg/.emacs.d/elpa/29.1/develop/company-20230926.32
- /home/greg/.emacs.d/elpa/29.1/develop/column-enforce-mode-20200605.1933
- /home/greg/.emacs.d/elpa/29.1/develop/code-cells-20220917.1431
- /home/greg/.emacs.d/elpa/29.1/develop/clean-aindent-mode-20171017.2043
- /home/greg/.emacs.d/elpa/29.1/develop/centered-cursor-mode-20230914.1358
- /home/greg/.emacs.d/elpa/29.1/develop/browse-at-remote-20230223.554
- /home/greg/.emacs.d/elpa/29.1/develop/blacken-20230821.1738
- /home/greg/.emacs.d/elpa/29.1/develop/auto-highlight-symbol-20221231.1631
- /home/greg/.emacs.d/elpa/29.1/develop/ht-20230703.558
- /home/greg/.emacs.d/elpa/29.1/develop/auto-dictionary-20150410.1610
- /home/greg/.emacs.d/elpa/29.1/develop/auto-compile-20230901.1232
- /home/greg/.emacs.d/elpa/29.1/develop/auctex-13.2.1/
- /home/greg/.emacs.d/elpa/29.1/develop/auctex-13.2.1
- /home/greg/.emacs.d/elpa/29.1/develop/anaconda-mode-20230821.2131
- /home/greg/.emacs.d/elpa/29.1/develop/pythonic-20230821.1733
- /home/greg/.emacs.d/elpa/29.1/develop/f-20230823.1159
- /home/greg/.emacs.d/elpa/29.1/develop/dash-20230714.723
- /home/greg/.emacs.d/elpa/29.1/develop/s-20220902.1511
- /home/greg/.emacs.d/elpa/29.1/develop/all-the-icons-20230909.2053
- /home/greg/.emacs.d/elpa/29.1/develop/aggressive-indent-20230112.1300
- /home/greg/.emacs.d/elpa/29.1/develop/ace-window-20220911.358
- /home/greg/.emacs.d/elpa/29.1/develop/ace-link-20220901.1710
- /home/greg/.emacs.d/elpa/29.1/develop/ace-jump-helm-line-20160918.1836
- /home/greg/.emacs.d/elpa/29.1/develop/helm-20231001.413
- /home/greg/.emacs.d/elpa/29.1/develop/popup-20230819.2306
- /home/greg/.emacs.d/elpa/29.1/develop/wfnames-20230924.1538
- /home/greg/.emacs.d/elpa/29.1/develop/helm-core-20231001.413
- /home/greg/.emacs.d/elpa/29.1/develop/avy-20230420.404
- /home/greg/.emacs.d/elpa/29.1/develop/pcre2el-20230828.1544
- /home/greg/.emacs.d/elpa/29.1/develop/hybrid-mode-20221027.164101
- /home/greg/.emacs.d/elpa/29.1/develop/holy-mode-20220917.95042
- /home/greg/.emacs.d/elpa/29.1/develop/evil-evilified-state-20231001.191938
- /home/greg/.emacs.d/elpa/29.1/develop/dotenv-mode-20191027.2129
- /home/greg/.emacs.d/elpa/29.1/develop/which-key-20230905.2128
- /home/greg/.emacs.d/elpa/29.1/develop/hydra-20220910.1206
- /home/greg/.emacs.d/elpa/29.1/develop/lv-20200507.1518
- /home/greg/.emacs.d/elpa/29.1/develop/evil-20230919.150608
- /home/greg/.emacs.d/elpa/29.1/develop/goto-chg-20220107.93340
- /home/greg/.emacs.d/elpa/29.1/develop/diminish-20220909.847
- /home/greg/.emacs.d/elpa/29.1/develop/bind-map-20220108.228
- /home/greg/.emacs.d/elpa/29.1/develop/async-20230528.622
- /home/greg/.emacs.d/core/../core/libs/forks/
- /home/greg/.emacs.d/core/../core/libs/spacemacs-theme/
- /home/greg/.emacs.d/core/../core/libs/
- /home/greg/.emacs.d/core/../core/
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/vc
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/use-package
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/url
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/textmodes
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/progmodes
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/play
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/org
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/nxml
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/net
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/mh-e
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/mail
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/leim
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/language
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/international
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/image
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/gnus
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/eshell
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/erc
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/emulation
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/emacs-lisp
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/cedet
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/calendar
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/calc
- /gnu/store/j5zjjncshwnnalv7l1nsfwa3l1aa48mv-emacs-29.1/share/emacs/29.1/lisp/obsolete
